app/controllers/admin_controller.rb

  def index
  	if current_user.user_type == "superAdmin"
  		@users_count= User.all.count
  		@posts_count= Post.all.count
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 4]]

  def user_data
    @users= User.all
---
SELECT "users".* FROM "users"

  def user_create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def user_destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

  def posts
  	if current_user.user_type == "superAdmin"
  		@posts= Post.all
  	else
  	    @posts= current_user.posts.all
---
SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 4]]

  def post_create
  	@post = current_user.posts.build(post_params)
  	if current_user.user_type == "manager"
  		@post.published= false
  	else
  		@post.published= true
  		@post.published_at= Time.now

  	end
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "published", "published_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["published", "t"], ["published_at", "2016-03-23 11:35:20.910956"], ["created_at", "2016-03-23 11:35:20.912999"], ["updated_at", "2016-03-23 11:35:20.912999"]]

  def post_update
  	respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "published_at" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["published_at", "2016-03-24 19:26:05.301074"], ["updated_at", "2016-03-24 19:26:05.303404"], ["id", 16]]