app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2016-03-23 09:53:48.650129"], ["updated_at", "2016-03-23 09:53:48.650129"]]
---
  def create
    @post = current_user.posts.build(post_params)



    respond_to do |format|
      if @post.save